experiments/results/logs/ramp-hybrid-010/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6808.616ms, rate sampling interval: 13819ms
  Thread calibration: mean lat.: 7114.506ms, rate sampling interval: 14852ms
  Thread calibration: mean lat.: 7113.031ms, rate sampling interval: 14548ms
  Thread calibration: mean lat.: 6791.086ms, rate sampling interval: 13975ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.34s    10.42s   33.59s    77.81%
    Req/Sec    25.31     26.86    80.00     74.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.96s 
 75.000%   18.14s 
 90.000%   25.82s 
 99.000%   31.42s 
 99.900%   32.62s 
 99.990%   33.52s 
 99.999%   33.62s 
100.000%   33.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.491     0.000000            1         1.00
       1.783     0.100000         2986         1.11
       2.299     0.200000         5980         1.25
       3.373     0.300000         8956         1.43
      10.151     0.400000        11940         1.67
    4964.351     0.500000        14928         2.00
    7811.071     0.550000        16418         2.22
   10543.103     0.600000        17911         2.50
   13303.807     0.650000        19405         2.86
   15384.575     0.700000        20898         3.33
   18137.087     0.750000        22394         4.00
   19660.799     0.775000        23137         4.44
   20938.751     0.800000        23885         5.00
   22118.399     0.825000        24628         5.71
   23625.727     0.850000        25395         6.67
   24739.839     0.875000        26120         8.00
   25411.583     0.887500        26499         8.89
   25821.183     0.900000        26868        10.00
   26542.079     0.912500        27251        11.43
   27279.359     0.925000        27616        13.33
   27705.343     0.937500        27996        16.00
   28311.551     0.943750        28171        17.78
   28508.159     0.950000        28358        20.00
   28721.151     0.956250        28555        22.86
   29425.663     0.962500        28748        26.67
   29556.735     0.968750        28923        32.00
   29720.575     0.971875        29015        35.56
   30359.551     0.975000        29108        40.00
   30425.087     0.978125        29216        45.71
   30507.007     0.981250        29297        53.33
   30654.463     0.984375        29385        64.00
   31293.439     0.985938        29432        71.11
   31358.975     0.987500        29489        80.00
   31408.127     0.989062        29537        91.43
   31440.895     0.990625        29577       106.67
   31522.815     0.992188        29623       128.00
   31539.199     0.992969        29641       142.22
   31637.503     0.993750        29666       160.00
   32276.479     0.994531        29689       182.86
   32342.015     0.995313        29714       213.33
   32358.399     0.996094        29734       256.00
   32407.551     0.996484        29752       284.44
   32423.935     0.996875        29772       320.00
   32423.935     0.997266        29772       365.71
   32440.319     0.997656        29785       426.67
   32489.471     0.998047        29796       512.00
   32505.855     0.998242        29801       568.89
   32522.239     0.998437        29806       640.00
   32538.623     0.998633        29814       731.43
   32571.391     0.998828        29816       853.33
   32636.927     0.999023        29825      1024.00
   32636.927     0.999121        29825      1137.78
   32653.311     0.999219        29827      1280.00
   32686.079     0.999316        29831      1462.86
   33259.519     0.999414        29833      1706.67
   33325.055     0.999512        29837      2048.00
   33325.055     0.999561        29837      2275.56
   33357.823     0.999609        29839      2560.00
   33406.975     0.999658        29840      2925.71
   33423.359     0.999707        29842      3413.33
   33439.743     0.999756        29843      4096.00
   33472.511     0.999780        29844      4551.11
   33488.895     0.999805        29845      5120.00
   33488.895     0.999829        29845      5851.43
   33505.279     0.999854        29846      6826.67
   33521.663     0.999878        29847      8192.00
   33521.663     0.999890        29847      9102.22
   33538.047     0.999902        29848     10240.00
   33538.047     0.999915        29848     11702.86
   33538.047     0.999927        29848     13653.33
   33619.967     0.999939        29850     16384.00
   33619.967     1.000000        29850          inf
#[Mean    =     9337.314, StdDeviation   =    10424.349]
#[Max     =    33587.200, Total count    =        29850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29954 requests in 5.00m, 159.17MB read
  Socket errors: connect 0, read 0, write 0, timeout 6606
  Non-2xx or 3xx responses: 28731
Requests/sec:     99.85
Transfer/sec:    543.30KB